<?xml version="1.0" ?>
<net name="saved_model" version="11">
	<layers>
		<layer id="0" name="input_10" type="Parameter" version="opset1">
			<data shape="?,128,128,3" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input_10"/>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0:0,input_10,input_10:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="StatefulPartitionedCall/model_12/sequential_43/instance_normalization_27/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="0" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_43/instance_normalization_27/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_43/instance_normalization_27/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/model_12/sequential_42/instance_normalization_26/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="128" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_42/instance_normalization_26/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_42/instance_normalization_26/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/model_12/sequential_41/instance_normalization_25/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="384" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_41/instance_normalization_25/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_41/instance_normalization_25/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="896" size="1024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp:0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="1920" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="2432" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="input_10/Transpose([0 3 1 2])/value40447133" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="2688" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="input_10/Transpose([0 3 1 2])/value40447133"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="input_10/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="input_10/Transpose([0 3 1 2])"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/model_12/sequential_37/conv2d_16/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 4, 4" offset="2720" size="6144"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_37/conv2d_16/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_37/conv2d_16/Conv2D/ReadVariableOp:0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/model_12/sequential_37/conv2d_16/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_37/conv2d_16/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_37/conv2d_16/Conv2D:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/model_12/sequential_37/leaky_re_lu_16/LeakyRelu/weights44597100" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="8864" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_37/leaky_re_lu_16/LeakyRelu/weights44597100"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/model_12/sequential_37/leaky_re_lu_16/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_37/leaky_re_lu_16/LeakyRelu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_37/leaky_re_lu_16/LeakyRelu:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/model_12/sequential_38/conv2d_17/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 4, 4" offset="8868" size="131072"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_38/conv2d_17/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_38/conv2d_17/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/model_12/sequential_38/conv2d_17/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_38/conv2d_17/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Func/StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/input/_61:0,Func/StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/input/_25:0,StatefulPartitionedCall/model_12/sequential_38/conv2d_17/Conv2D:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="40637226" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="139940" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="40637226"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/moments/mean" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/moments/mean"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/sub, StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/sub/neg_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/sub:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference" type="SquaredDifference" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="40697175" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="139940" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="40697175"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add/y" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="139956" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add/y"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add/y:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="312" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="139960" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="312"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/Rsqrt/pow_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/Rsqrt/pow_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/Rsqrt:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/mul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/mul:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/mul_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/mul_1:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add_1/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="139964" size="256"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add_1/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add_1/ReadVariableOp:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Func/StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/output/_64:0,Func/StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/output/_28:0,StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add_1:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/model_12/sequential_38/leaky_re_lu_17/LeakyRelu/weights44556971" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="8864" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_38/leaky_re_lu_17/LeakyRelu/weights44556971"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/model_12/sequential_38/leaky_re_lu_17/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_38/leaky_re_lu_17/LeakyRelu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_38/leaky_re_lu_17/LeakyRelu:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/model_12/sequential_39/conv2d_18/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="128, 64, 4, 4" offset="140220" size="524288"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_39/conv2d_18/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_39/conv2d_18/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/model_12/sequential_39/conv2d_18/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_39/conv2d_18/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Func/StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/input/_67:0,Func/StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/input/_31:0,StatefulPartitionedCall/model_12/sequential_39/conv2d_18/Conv2D:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="40796977" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="139940" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="40796977"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/moments/mean" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/moments/mean"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/sub, StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/sub/neg_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/sub:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference" type="SquaredDifference" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="40856965" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="139940" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="40856965"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add/y" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="139956" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add/y"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add/y:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="310" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="139960" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="310"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/Rsqrt/pow_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/Rsqrt/pow_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/Rsqrt:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/mul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/mul:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/mul_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/mul_1:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add_1/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="664508" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add_1/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add_1/ReadVariableOp:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Func/StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/output/_70:0,Func/StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/output/_34:0,StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add_1:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/model_12/sequential_39/leaky_re_lu_18/LeakyRelu/weights44477079" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="8864" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_39/leaky_re_lu_18/LeakyRelu/weights44477079"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/model_12/sequential_39/leaky_re_lu_18/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_39/leaky_re_lu_18/LeakyRelu"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_39/leaky_re_lu_18/LeakyRelu:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/model_12/sequential_40/conv2d_19/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" shape="256, 128, 4, 4" offset="665020" size="2097152"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_40/conv2d_19/Conv2D/ReadVariableOp"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_40/conv2d_19/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/model_12/sequential_40/conv2d_19/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_40/conv2d_19/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Func/StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/input/_73:0,Func/StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/input/_37:0,StatefulPartitionedCall/model_12/sequential_40/conv2d_19/Conv2D:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="40957163" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="139940" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="40957163"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/moments/mean" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/moments/mean"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/sub, StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/sub/neg_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/sub:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference" type="SquaredDifference" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="41017151" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="139940" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="41017151"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/add/y" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="139956" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/add/y"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/add/y:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/add:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="304" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="139960" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="304"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/Rsqrt/pow_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/Rsqrt/pow_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/Rsqrt:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/mul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/mul:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/mul_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
