<?xml version="1.0" ?>
<net name="frozen_unet" version="10">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 3, 128, 128"/>
			<output>
				<port id="0" names="x:0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="model_12/sequential_43/instance_normalization_27/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" names="model_12/sequential_43/instance_normalization_27/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="model_12/sequential_42/instance_normalization_26/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="64" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" names="model_12/sequential_42/instance_normalization_26/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="model_12/sequential_41/instance_normalization_25/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="192" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" names="model_12/sequential_41/instance_normalization_25/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="448" shape="1, 256, 1, 1" size="512"/>
			<output>
				<port id="0" names="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="960" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" names="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="1216" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" names="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="model_12/sequential_37/conv2d_16/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="1344" shape="32, 3, 4, 4" size="3072"/>
			<output>
				<port id="0" names="model_12/sequential_37/conv2d_16/Conv2D/ReadVariableOp:0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="model_12/sequential_37/conv2d_16/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_37/conv2d_16/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="model_12/sequential_37/leaky_re_lu_16/LeakyRelu/weights46077086" type="Const" version="opset1">
			<data element_type="f32" offset="4416" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="model_12/sequential_37/leaky_re_lu_16/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_37/leaky_re_lu_16/LeakyRelu:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="model_12/sequential_38/conv2d_17/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="4420" shape="64, 32, 4, 4" size="65536"/>
			<output>
				<port id="0" names="model_12/sequential_38/conv2d_17/Conv2D/ReadVariableOp:0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="model_12/sequential_38/conv2d_17/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Func/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/input/_37:0,Func/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/input/_1:0,model_12/sequential_38/conv2d_17/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="39327101" type="Const" version="opset1">
			<data element_type="i64" offset="69956" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/moments/mean" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/sub/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/sub:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference" type="SquaredDifference" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="39387125" type="Const" version="opset1">
			<data element_type="i64" offset="69956" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add/y" type="Const" version="opset1">
			<data element_type="f16" offset="69972" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add/y:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="286" type="Const" version="opset1">
			<data element_type="f16" offset="69974" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/Rsqrt/pow_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/Rsqrt:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/mul:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/mul_1:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add_1/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="69976" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" names="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add_1/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Func/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/output/_40:0,Func/model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/output/_4:0,model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/Identity:0,model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/Identity:0,model_12/sequential_38/instance_normalization_22/StatefulPartitionedCall/StatefulPartitionedCall/add_1:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="model_12/sequential_38/leaky_re_lu_17/LeakyRelu/weights45957188" type="Const" version="opset1">
			<data element_type="f32" offset="4416" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="model_12/sequential_38/leaky_re_lu_17/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_38/leaky_re_lu_17/LeakyRelu:0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="model_12/sequential_39/conv2d_18/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="70104" shape="128, 64, 4, 4" size="262144"/>
			<output>
				<port id="0" names="model_12/sequential_39/conv2d_18/Conv2D/ReadVariableOp:0" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="model_12/sequential_39/conv2d_18/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Func/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/input/_43:0,Func/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/input/_7:0,model_12/sequential_39/conv2d_18/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="39487065" type="Const" version="opset1">
			<data element_type="i64" offset="69956" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/moments/mean" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/sub/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/sub:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference" type="SquaredDifference" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="39547245" type="Const" version="opset1">
			<data element_type="i64" offset="69956" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add/y" type="Const" version="opset1">
			<data element_type="f16" offset="69972" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add/y:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="280" type="Const" version="opset1">
			<data element_type="f16" offset="69974" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/Rsqrt/pow_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/Rsqrt:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/mul:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/mul_1:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add_1/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="332248" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" names="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add_1/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Func/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/output/_46:0,Func/model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/output/_10:0,model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/Identity:0,model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/Identity:0,model_12/sequential_39/instance_normalization_23/StatefulPartitionedCall/StatefulPartitionedCall/add_1:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="model_12/sequential_39/leaky_re_lu_18/LeakyRelu/weights45997269" type="Const" version="opset1">
			<data element_type="f32" offset="4416" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="model_12/sequential_39/leaky_re_lu_18/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_39/leaky_re_lu_18/LeakyRelu:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="model_12/sequential_40/conv2d_19/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="332504" shape="256, 128, 4, 4" size="1048576"/>
			<output>
				<port id="0" names="model_12/sequential_40/conv2d_19/Conv2D/ReadVariableOp:0" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="model_12/sequential_40/conv2d_19/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Func/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/input/_49:0,Func/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/input/_13:0,model_12/sequential_40/conv2d_19/Conv2D:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="39647161" type="Const" version="opset1">
			<data element_type="i64" offset="69956" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/moments/mean" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/sub/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/sub:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference" type="SquaredDifference" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="39707251" type="Const" version="opset1">
			<data element_type="i64" offset="69956" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/add/y" type="Const" version="opset1">
			<data element_type="f16" offset="69972" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/add/y:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="278" type="Const" version="opset1">
			<data element_type="f16" offset="69974" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/Rsqrt/pow_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/Rsqrt:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/mul:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/mul_1:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/add_1/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="1381080" shape="1, 256, 1, 1" size="512"/>
			<output>
				<port id="0" names="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/add_1/ReadVariableOp:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Func/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/output/_52:0,Func/model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/output/_16:0,model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/Identity:0,model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/Identity:0,model_12/sequential_40/instance_normalization_24/StatefulPartitionedCall/StatefulPartitionedCall/add_1:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="model_12/sequential_40/leaky_re_lu_19/LeakyRelu/weights46037092" type="Const" version="opset1">
			<data element_type="f32" offset="4416" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="model_12/sequential_40/leaky_re_lu_19/LeakyRelu" type="PReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_40/leaky_re_lu_19/LeakyRelu:0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="model_12/sequential_41/conv2d_transpose_29/conv2d_transpose/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f16" offset="1381592" shape="256, 128, 4, 4" size="1048576"/>
			<output>
				<port id="0" names="model_12/sequential_41/conv2d_transpose_29/conv2d_transpose/ReadVariableOp:0" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="model_12/sequential_41/conv2d_transpose_29/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="model_12/sequential_41/conv2d_transpose_29/Shape/GatherNCHWtoNHWC_input_port_1/value37787353" type="Const" version="opset1">
			<data element_type="i32" offset="2430168" shape="4" size="16"/>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="model_12/sequential_41/conv2d_transpose_29/Shape/GatherNCHWtoNHWC_input_port_2/value37807053" type="Const" version="opset1">
			<data element_type="i64" offset="2430184" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="69" name="model_12/sequential_41/conv2d_transpose_29/Shape/GatherNCHWtoNHWC" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="model_12/sequential_41/conv2d_transpose_29/Shape:0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="model_12/sequential_41/conv2d_transpose_29/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" offset="2430184" shape="1" size="8"/>
			<output>
				<port id="0" names="model_12/sequential_41/conv2d_transpose_29/strided_slice/stack:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="model_12/sequential_41/conv2d_transpose_29/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" offset="2430192" shape="1" size="8"/>
			<output>
				<port id="0" names="model_12/sequential_41/conv2d_transpose_29/strided_slice/stack_1:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="model_12/sequential_41/conv2d_transpose_29/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" offset="2430192" shape="1" size="8"/>
			<output>
				<port id="0" names="model_12/sequential_41/conv2d_transpose_29/strided_slice/stack_2:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="model_12/sequential_41/conv2d_transpose_29/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="model_12/sequential_41/conv2d_transpose_29/strided_slice:0" precision="I32"/>
			</output>
		</layer>
		<layer id="74" name="model_12/sequential_41/conv2d_transpose_29/stack/Unsqueeze_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="2430184" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="model_12/sequential_41/conv2d_transpose_29/stack/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="model_12/sequential_41/conv2d_transpose_29/stack/Unsqueeze309" type="Const" version="opset1">
			<data element_type="i32" offset="2430200" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="model_12/sequential_41/conv2d_transpose_29/stack/Unsqueeze311" type="Const" version="opset1">
			<data element_type="i32" offset="2430200" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="model_12/sequential_41/conv2d_transpose_29/stack/Unsqueeze313" type="Const" version="opset1">
			<data element_type="i32" offset="2430204" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="model_12/sequential_41/conv2d_transpose_29/stack" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="model_12/sequential_41/conv2d_transpose_29/conv2d_transpose/GatherNHWCtoNCHW_input_port_1/value38207152" type="Const" version="opset1">
			<data element_type="i32" offset="2430208" shape="4" size="16"/>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="model_12/sequential_41/conv2d_transpose_29/conv2d_transpose/GatherNHWCtoNCHW_input_port_2/value38227071" type="Const" version="opset1">
			<data element_type="i64" offset="2430184" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="82" name="model_12/sequential_41/conv2d_transpose_29/conv2d_transpose/GatherNHWCtoNCHW" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="model_12/sequential_41/conv2d_transpose_29/conv2d_transpose/ss_0_port_input_port_1/value63867128" type="Const" version="opset1">
			<data element_type="i64" offset="2430224" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="model_12/sequential_41/conv2d_transpose_29/conv2d_transpose/ss_0_port_input_port_2/value63887272" type="Const" version="opset1">
			<data element_type="i64" offset="2430232" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="model_12/sequential_41/conv2d_transpose_29/conv2d_transpose/ss_0_port_input_port_3/value63907293" type="Const" version="opset1">
			<data element_type="i64" offset="2430192" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="model_12/sequential_41/conv2d_transpose_29/conv2d_transpose/ss_0_port" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="1" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="model_12/sequential_41/conv2d_transpose_29/conv2d_transpose/Cast_2" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="model_12/sequential_41/conv2d_transpose_29/conv2d_transpose" type="ConvolutionBackpropData" version="opset1">
			<data auto_pad="same_lower" dilations="1, 1" output_padding="0, 0" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" names="Func/model_12/sequential_41/instance_normalization_25/StatefulPartitionedCall/StatefulPartitionedCall/input/_55:0,Func/model_12/sequential_41/instance_normalization_25/StatefulPartitionedCall/input/_19:0,model_12/sequential_41/conv2d_transpose_29/conv2d_transpose:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="39807083" type="Const" version="opset1">
			<data element_type="i64" offset="69956" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="model_12/sequential_41/instance_normalization_25/StatefulPartitionedCall/StatefulPartitionedCall/moments/mean" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="model_12/sequential_41/instance_normalization_25/StatefulPartitionedCall/StatefulPartitionedCall/sub/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_41/instance_normalization_25/StatefulPartitionedCall/StatefulPartitionedCall/sub:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="model_12/sequential_41/instance_normalization_25/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference" type="SquaredDifference" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_41/instance_normalization_25/StatefulPartitionedCall/StatefulPartitionedCall/moments/SquaredDifference:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="39867278" type="Const" version="opset1">
			<data element_type="i64" offset="69956" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="model_12/sequential_41/instance_normalization_25/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="model_12/sequential_41/instance_normalization_25/StatefulPartitionedCall/StatefulPartitionedCall/moments/variance:0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
